{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Accepting",
    "1": "Anger",
    "2": "Disappointed",
    "3": "Disgust",
    "4": "Enjoyment",
    "5": "Fear",
    "6": "Highly Negative",
    "7": "Hopeless",
    "8": "Hurt",
    "9": "Indifferent",
    "10": "Loneliness",
    "11": "Lonely",
    "12": "Neutral",
    "13": "Other",
    "14": "Sadness",
    "15": "Spam",
    "16": "Surprise"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Accepting": 0,
    "Anger": 1,
    "Disappointed": 2,
    "Disgust": 3,
    "Enjoyment": 4,
    "Fear": 5,
    "Highly Negative": 6,
    "Hopeless": 7,
    "Hurt": 8,
    "Indifferent": 9,
    "Loneliness": 10,
    "Lonely": 11,
    "Neutral": 12,
    "Other": 13,
    "Sadness": 14,
    "Spam": 15,
    "Surprise": 16
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 258,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tokenizer_class": "PhobertTokenizer",
  "transformers_version": "4.57.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 64001
}
